/**
 * @file  HardwareParameter.h
 * @brief ハードウェアパラメータを記述したヘッダ
 */

#ifndef __HARDWAREPARAMETER_H__
#define __HARDWAREPARAMETER_H__
/*----------------------------------------------------------------------
	Includes
 ----------------------------------------------------------------------*/
#include "../typedefine.h"

/*----------------------------------------------------------------------
	Macro Definitions
 ----------------------------------------------------------------------*/
#define HW_WHEEL_DIAM	17		// 車輪径 [mm]
#define HW_TREAD_WIDTH	38.5	// トレッド幅 [mm]

/*----------------------------------------------------------------------
	Public Method Declarations
 ----------------------------------------------------------------------*/

#endif /* __HARDWAREPARAMETER_H__ */
