/**
 * @file  LightSensor.h
 * @brief 光センサの動作を司るクラス
 */

#ifndef __LIGHTSENSOR_H__
#define __LIGHTSENSOR_H__
/*----------------------------------------------------------------------
	インクルード
 ----------------------------------------------------------------------*/
#include "../typedefine.h"

/*----------------------------------------------------------------------
	定数定義
 ----------------------------------------------------------------------*/

/*----------------------------------------------------------------------
	構造体の定義
 ----------------------------------------------------------------------*/

/*----------------------------------------------------------------------
	ソースコード
 ----------------------------------------------------------------------*/
/* ==== プライベートプロパティ ==== */

/* ==== パブリックメソッド ==== */
/* 光センサの初期化
 * @param void
 * @retval void
 */
void InitializeLightSensor(void);

/** CMT0コンペアマッチによる割り込み
 * @param void
 * @retval void
 */
void IntCMT0(void);

/* ==== プライベートメソッド ==== */
/* 12ビットA/Dコンバータの初期化
 * @param void
 * @retval void
 */
static void InitializeADC(void);

/* DMACの初期化
 * @param void
 * @retval void
 */
static void InitializeDMAC(void);

/** コンペアマッチタイマ0(CMT0)の初期化
 * @param void
 * @retval void
 */
static void InitializeCMT0(void);

#endif
