/**
 * @file  Speaker.h
 * @brief スピーカーの動作を司るクラス
 */

#ifndef __SPEAKER_H__
#define __SPEAKER_H__
/*----------------------------------------------------------------------
	Includes
 ----------------------------------------------------------------------*/
#include "../typedefine.h"

/*----------------------------------------------------------------------
	Macro Definitions
 ----------------------------------------------------------------------*/
#define SPEAKER_PORT	PORTE.PODR.BIT.B2

/*----------------------------------------------------------------------
	Public Method Declarations
 ----------------------------------------------------------------------*/
void Speaker_Initialize(void);
void Speaker_PlaySound(_UINT freq);

#endif /* __SPEAKER_H__ */
