/**
 * @file  Switch.h
 * @brief スイッチの動作を司るクラス
 */

#ifndef __SWITCH_H__
#define __SWITCH_H__
/*----------------------------------------------------------------------
	Includes
 ----------------------------------------------------------------------*/
#include "../typedefine.h"
#include "stdbool.h"

/*----------------------------------------------------------------------
	Macro Definitions
 ----------------------------------------------------------------------*/
#define SW !PORTC.PIDR.BIT.B7

/*----------------------------------------------------------------------
	Public Method Declarations
 ----------------------------------------------------------------------*/
void Switch_Initialize(void);
bool Switch_GetState(void);

#endif /* __SWITCH_H__ */
