/**
 * @file  Timer.h
 * @brief タイマー
 */

#ifndef __TIMER_H__
#define __TIMER_H__
/*----------------------------------------------------------------------
	インクルード
 ----------------------------------------------------------------------*/
#include "../typedefine.h"

/*----------------------------------------------------------------------
	ソースコード
 ----------------------------------------------------------------------*/
/** 指定ミリ秒待つ
 * @param msec : 待つミリ秒
 * @retval void
 */
void WaitMS(unsigned int msec);

/** 指定マイクロ秒待つ
 * @param usec : 待つマイクロ秒
 * @retval void
 */
void WaitUS(unsigned int usec);

#endif
